{
    "experience": [
        {
            "company": "Naval Nuclear Laboratory",
            "title": "Mechanical/Chemical Engineering Intern",
            "years": "May 2024 - Aug 2024",
            "description": "Join the team at the Naval Nuclear Laboratory for the NNL Summer Technical Internship program! You'll gain hands-on experience working with top engineers and scientists on real-world projects. Highlights include presentations, meetings with leadership, mentorship, facility tours, and networking opportunities. Make a real impact in the field and gain invaluable experience!",
            "label": "navy"
        },
        {
            "company": "DOD National Security Innovation Network",
            "title": "X-Force Fellow",
            "years": "May 2023 - Aug 2023",
            "description": "Be part of an immersive research experience at the Naval Surface Warfare Center Crane! Explore radiation effects studies on novel quantum-enabled topological insulators, delving into cryogenics, electrical signal noise, and quantum computing. Design data collection hardware for a groundbreaking neutron-scattering experiment on TIs and lead weekly discussions on advanced topics. Don't miss this opportunity to contribute to cutting-edge scientific research!",
            "label": "dod"
        },
        {
            "company": "━━ University of Central Florida ━━",
            "title": "Undergraduate Teaching Assistant",
            "years": "JAN 2023 - MAY 2024",
            "description": "Discover the invaluable support of our Undergraduate Teaching Assistant from the University of Central Florida! They conducted weekly office hours, developed examination rubrics, facilitated review sessions, and ensured consistent evaluation standards for homework and exams in courses like Heat Transfer and Solid Mechanics. With their guidance, over 200 students received constructive feedback and guidance, leading to a great learning experience!",
            "label": "uta"
        },
        {
            "company": "Hybrid Materials and Surface Lab",
            "title": "Undergraduate Researcher",
            "years": "Oct 2020 - Dec 2022",
            "description": "research description goes here",
            "label": "lab"
        }
    ]
}